Repository: gyorfimarcell/Dusza2025
Catalog: Cluster/Cluster/Resources/Strings.*.resx
Languages: hu_hu

# Settings.Darkmode.Title
source: Dark mode
hu_hu: Sötét mód

# Settings.Language.English
source: English
hu_hu: Angol

# Settings.Language.Hungarian
source: Hungarian
hu_hu: Magyar

# Settings.Language.Title
source: Language
hu_hu: Nyelv

# Settings.Title
source: Settings
hu_hu: Beállítások

# Window.Title
source: Cluster Management
hu_hu: Klaszter Kezelő

# Menu.Health
source: Cluster Health
hu_hu: Klaszter Állapot

# Menu.Computers
source: Computers
hu_hu: Számítógépek

# Menu.Processes
source: Processes
hu_hu: Folyamatok

# Menu.Programs
source: Programs
hu_hu: Programok

# Menu.Logs
source: Cluster Logs
hu_hu: Klaszter Naplók

# Menu.Settings
source: Settings
hu_hu: Beállítások

# Menu.Path.Label
source: Cluster:
hu_hu: Klaszter:

# Menu.Path.None
source: None
hu_hu: Nincs

# Menu.Load
source: Load Cluster
hu_hu: Klaszter Betöltése

# Menu.Generate
source: Generate Cluster
hu_hu: Klaszter Generálása

# Menu.LoadAnother
source: Load Another Cluster
hu_hu: Másik Klaszter Betöltése

# Menu.Invalid.Title
source: Invalid folder
hu_hu: Érvénytelen mappa

# Menu.Invalid.Text
source: The chosen folder doesn't contain a .klaszter file.
hu_hu: A kiválasztott mappa nem tartalmaz .klaszter fájlt.

source: Close
hu_hu: Bezárás

# StartPage.Title
source: No Cluster Opened
hu_hu: Nincs Megnyitott Klaszter

# StartPage.Description
source: Click here to select a folder
hu_hu: Kattintson ide egy mappa kiválasztásához

source: New
hu_hu: Új

# AddComputerPage.Name.Title
source: Name
hu_hu: Név

# AddComputerPage.Name.Description
source: A unique identifier for this computer.
hu_hu: Egy egyedi azonosító a számítógépnek.

source: Processor Capacity
hu_hu: Processzor Kapacitás

source: Memory Capacity
hu_hu: Memória Kapacitás

source: Add
hu_hu: Hozzáadás

# Errors.Error
source: Error
hu_hu: Hiba!

# Errors.MissingFields
source: You must fill out all fields!
hu_hu: Az összes mező kitöltése kötelező!

# AddComputerPage.Success.Title
source: Computer created
hu_hu: Számítógép létrehozva

# AddComputerPage.Success.Text
source: successfully created.
hu_hu: sikeresen létrehozva.

# AddProgramPage.Name.Title
source: Name
hu_hu: Név

# AddProgramPage.Name.Description
source: A unique identifier for this program.
hu_hu: Egy egyedi azonosító a programnak.

# AddProgramPage.Active.Title
source: Active Processes
hu_hu: Aktív Folyamatok

# AddProgramPage.Active.Description
source: How many active processes should run in the cluster.
hu_hu: Mennyi aktív folyamat fusson a klaszteren.

source: Processor Usage
hu_hu: Processzor Használat

source: Memory Usage
hu_hu: Memória Használat

# Errors.ProgramAlreadyExists
source: This program already exists in the cluster!
hu_hu: Ez a program már létezik a klaszterben!

# AddProgramPage.Success.Title
source: Program created
hu_hu: Program létrehozva

# AddProgramPage.Success.Text
source: successfully created.
hu_hu: sikeresen létrehozva.

source: Edit
hu_hu: Szerkesztés

source: Delete
hu_hu: Törlés

source: Programs
hu_hu: Programok

source: Processes
hu_hu: Folyamatok

# ComputerDetailsPage.Empty.Title
source: No processes
hu_hu: Nincsenek folyamatok

# ComputerDetailsPage.Empty.Description
source: This computer doesn't have any running processes.
hu_hu: Ezen a számítógépen nincsenek futó folyamatok.

source: Processor
hu_hu: Processzor

source: Memory
hu_hu: Memória

source: Active
hu_hu: Aktív

source: Inactive
hu_hu: Inaktív

# ComputerDetailsPage.Processes
source: Processes
hu_hu: Folyamat

# ComputerDetailsPage.DeleteSuccess.Title
source: Computer deleted
hu_hu: Számítógép törölve

# ComputerDetailsPage.DeleteSuccess.Text
source: successfully deleted.
hu_hu: sikeresen törölve.

# Outsourcing.DeleteSuccess
source: Outsourcing and deletion succeeded!
hu_hu: Kiszervezés és törlés sikeres!

# FilterPlaceholder
source: Filter...
hu_hu: Szűrés...

# ComputersPage.Sort.Name
source: Name
hu_hu: Név

# ComputersPage.Sort.ProcessorPercent
source: Processor Usage (%)
hu_hu: Processzor Használat (%)

# ComputersPage.Sort.MemoryPercent
source: Memory Usage (%)
hu_hu: Memória Használat (%)

source: Descending
hu_hu: Csökkenő

# ComputersPage.Menu.Optimize
source: Optimize
hu_hu: Optimalizálás

source: Export
hu_hu: Exportálás

# ComputersPage.Empty.Title
source: No computers
hu_hu: Nincsenek számítógépek

# ComputersPage.Empty.EmptyText
source: There are no computers in this cluster.
hu_hu: Ebben a klaszterben nincsenek számítógépek.

# ComputersPage.Empty.FilterText
source: There are no computers matching this filter.
hu_hu: Nincsenek ennek a szűrőnek megfelelő számítógépek.

# Optimize.Title
source: Set optimization values
hu_hu: Optimalizálási értékek megadása

# Optimize.Button
source: Optimize
hu_hu: Optimalizálás

source: Cancel
hu_hu: Mégse

# Optimize.SpreadQuestion
source: Optimizing cannot be done with the given values! Would you like to spread the processes equally?
hu_hu: Ezekkel az értékekkel nem lehet optimalizálni. Szeretné egyenletesen elosztani a folyamatokat?

# Optimize.Spread
source: Spread
hu_hu: Szórás

source: Success
hu_hu: Siker!

# Optimize.Spread.Success
source: Processes were spread equally!
hu_hu: A folyamatok egyenlően szét lettek szórva!

# Optimize.Success
source: Optimization was successful!
hu_hu: Az optimalizálás sikeres volt!

# GeneratePage.ComputerCount
source: Number of computers
hu_hu: Számítógépek száma

# GeneratePage.ProgramCount
source: Number of programs
hu_hu: Programok száma

# GeneratePage.ProcessCount
source: Number of processes
hu_hu: Folyamatok száma

# GeneratePage.Path
source: Cluster path
hu_hu: Klaszter elérési út

# GeneratePage.Path.Choose
source: Choose path
hu_hu: Elérési út kiválasztása

# GeneratePage.Generate
source: Generate
hu_hu: Generálás

source: Save
hu_hu: Mentés

# ModifyComputerPage.Title
source: Edit {0}
hu_hu: {0} szerkesztése

# ModifyComputerPage.Success.Text
source: successfully modified.
hu_hu: sikeresen módosítva.

# ModifyProgramPage.Title
source: Edit {0}
hu_hu: {0} szerkesztése

# ModifyProgramPage.Success.Text
source: successfully modified.
hu_hu: sikeresen módosítva.

# NewInstancePage.Computer
source: Computer
hu_hu: Számítógép

# NewInstancePage.Run
source: Run
hu_hu: Futtatás

# Errors.NotEnoughResources
source: This computer doesn't have enough resources!
hu_hu: Ennek a számítógépnek nincs elég erőforrás!

# NewInstancePage.Success.Title
source: Process started
hu_hu: Folyamat elindítva

# NewInstancePage.Success.Text
source: Process '{0}' is now running on '{1}'.
hu_hu: Folyamat '{0}' elindítva a(z) '{1}' számítógépen.

# ProcessesPage.Status.Active
source: Active only
hu_hu: Csak aktív

# ProcessesPage.Status.Inactive
source: Inactive only
hu_hu: Csak inaktív

source: All
hu_hu: Összes

# ProcessesPage.Sort.Time
source: Start time
hu_hu: Indítási idő

source: Computers
hu_hu: Számítógépek

# ProcessesPage.Empty.Title
source: No processes
hu_hu: Nincsenek folyamatok

# ProcessesPage.Empty.Description
source: There are no processes matching this filter.
hu_hu: Nincsenek ennek a szűrőnek megfelelő folyamatok.

# ProgramsPage.Sort.Name
source: Name
hu_hu: Név

# ProgramsPage.Sort.Requested
source: Requested processes
hu_hu: Elvárt folyamatok

# ProgramsPage.Requested
source: Requested
hu_hu: Elvárt

# ProgramsPage.CardRequested
source: Requested {0} processes
hu_hu: {0} elvárt folyamat

# ProgramsPage.Empty.Title
source: No programs
hu_hu: Nincsenek programok

# ProgramsPage.Empty.FilterText
source: There are no programs matching this filter.
hu_hu: Nincsenek ennek a szűrőnek megfelelő programok.

# ProgramsPage.Empty.EmptyText
source: There are no programs in this cluster.
hu_hu: Ebben a klaszterben nincsenek programok.

# ProgramsPage.Shutdown.Title
source: Shut down {0}?
hu_hu: {0} leállítása?

# ProgramsPage.Shutdown.Text
source: This will shut down all {0} processes.
hu_hu: Ez mind a(z) {0} folyamatot leállítja.

# ProgramsPage.Shutdown
source: Shutdown
hu_hu: Leállítás

# ProgramsPage.Shutdown.Success
source: successfully shut down.
hu_hu: sikeresen leállítva.

# HealthPage.Fix
source: Fix issues
hu_hu: Problémák javítása

# HealthPage.Healthy.Title
source: Healthy
hu_hu: Egészséges

# HealthPage.Healthy.Description
source: No errors were detected in this cluster.
hu_hu: Ebben a klaszterben nem található hiba.

# Errors.FixFail
source: Failed to fix all errors
hu_hu: Nem sikerült minden hibát kijavítani. További részletekért tekintse meg a naplót.

# HealthPage.Fixed
source: All errors fixed ({0} errors)
hu_hu: Minden hiba kijavítva ({0} hiba)

# Logs.Empty
source: No logs to show
hu_hu: Nincs megjeleníthető napló

# Logs.Empty.Text
source: There are no logs matching this filter.
hu_hu: Nincsenek ennek a szűrőnek megfelelő naplófájlok.

# Logs.AllTypes
source: All log types
hu_hu: Minden típus

# Logs.AllDetails
source: All log details
hu_hu: Minden részlet

# Logs.ExpandAll
source: Expand All
hu_hu: Összes nyitása

# ProcessesPage.ComputerTooltip
source: processes
hu_hu: folyamat

# Optimize.Popup.Title
source: Set the optimal minimum and maximum usage percentage of a computer!
hu_hu: Állítsa be a minimum és maximum kihasználtságát a számítógépeknek!

# Optimize.Inactive
source: Any inactive process will remain untouched.
hu_hu: Az inaktív folyamatok nem lesznek változtatva.

# Optimize.Minimum
source: Minimum Percentage
hu_hu: Minimum százalék

# Optimize.Maximum
source: Maximum Percentage
hu_hu: Minimum százalék

# Health.NotEnough
source: {0} doesn't have enough processes ({1} wanted, {2} active, {3} inactive)
hu_hu: A {0} programból nincs elég folyamat ({1} elvárt, {2} aktív, {3} inaktív)

# Health.TooMany
source: {0} has too many processes ({1} wanted, {2} active, {3} inactive)
hu_hu: A {0} programból túl sok folyamat van ({1} elvárt, {2} aktív, {3} inaktív)

# Health.Processor
source: {0} doesn't have enough processor capacity ({1}/{2})
hu_hu: A {0} számítógépnek nincs elég processzor kapacitása ({1}/{2})

# Health.Memory
source: {0} doesn't have enough memory capacity ({1}/{2})
hu_hu: A {0} számítógépnek nincs elég memória kapacitása ({1}/{2})

# HealthPage.NotFixable.Title
source: Problems not fixable
hu_hu: A problémák nem megoldhatóak

# HealthPage.NotFixable.Text
source: The issues cannot be solved completely. Would you like to continue anyway?
hu_hu: A problémák nem oldhatóak meg teljesen. Szeretné ennek ellenére is folytatni?

source: Continue
hu_hu: Folytatás

# Errors.ComputerNameTaken
source: A computer already uses this name
hu_hu: Egy számítógép már használja ezt a nevet

# Errors.ComputerPositive
source: The amount of cpu cores and memory must be positive.
hu_hu: A processzormagok száma és a memória pozitív kell hogy legyen.

# Errors.ComputerMoreProcessor
source: The processes running on this computer require more processor capacity!
hu_hu: A számítógépen futó folyamatok több processzor kapacitást igényelnek!

# Errors.ComputerMoreMemory
source: The processes running on this computer require more memory capacity!
hu_hu: A számítógépen futó folyamatok több memória kapacitást igényelnek!

# Computer.Delete.Text
source: Deletion failed as this computer is running programs, but they can be outsourced to other machines. Would you like to proceed?
hu_hu: A törlés sikertelen, mivel ezen a számítógépen futnak programok. Ezek a folyamatok kiszervezhetőek más gépekre. Szeretné folytatni?

# Computer.Delete
source: Delete
hu_hu: Törlés

# Computer.Delete.Outsource
source: Outsource only
hu_hu: Csak kiszervezés

# Errors.OutsourceNotEnoughSpace
source: There's not enough space to completely outsource all processes. Continue anyway?
hu_hu: Nincs elég hely az összes program kiszervezéséhez. Szeretné folytatni?

# Errors.Outsource.Cancel
source: Outsourcing canceled.
hu_hu: Kiszervezés megszakítva.

# Errors.Outsource.Fail
source: Outsourcing failed! Please try again later.
hu_hu: Kiszervezés sikertelen. Próbálja újra később.

# Outsourcing.Success
source: Outsourcing succeeded! You can delete now the '{0}' safely.
hu_hu: Kiszervezés sikeres! A {0} számítógép most már biztonságosan törölhető.

# Outsourcing.PartialSuccess
source: Outsourced as many processes as possible! {0} processes remain on '{1}' computer.
hu_hu: A lehető legtöbb folyamat ki lett szervezve! {0} folyamat maradt a(z) {1} számítógépen.

# Errors.OutsourcingOther
source: There's not enough resource on other computers to outsource.
hu_hu: Nincs elég erőforrás a többi gépen a kiszervezéshez.

# Errors.OutsourcingNone
source: There are no computers or active processes to optimize!
hu_hu: Nincsenek számítógépek vagy aktív folyamatok a kiszervezéshez!

# Errors.OptimizeCannotFit
source: There were some processes that cannot fit any computers! Would you like to optimize anyway?
hu_hu: Vannak folyamatok amik egy számítógépre sem férnek. Szeretné ennek ellenére is optimalizáni?

# Optimize.Cancel
source: The optimization was cancelled.
hu_hu: Optimalizálás megszakítva.

# Errors.SpreadNone
source: There are no computers or active processes to spread!
hu_hu: Nincsenek számítógépek vagy aktív folyamatok a szóráshoz!

# LogType.OpenProgram
source: Open Program
hu_hu: Program Megnyitás

# LogType.CloseProgram
source: Close Program
hu_hu: Program Bezárás

# LogType.LoadCluster
source: Load Cluster
hu_hu: Klaszter Betöltés

# LogType.AddComputer
source: Add Computer
hu_hu: Számítógép hozzáadás

# LogType.DeleteComputer
source: Delete Computer
hu_hu: Számítógép Törlés

# LogType.ExportCSV
source: Export CSV
hu_hu: CSV Exportálás

# LogType.AddProgram
source: Add Program
hu_hu: Program Hozzáadás

# LogType.RunProgramInstance
source: Run Process
hu_hu: Folyamat Indítás

# LogType.ShutdownProgramInstance
source: Shutdown Process
hu_hu: Folyamat Leállítás

# LogType.ModifyProgram
source: Modify Program
hu_hu: Program Módosítás

# LogType.ShutdownProgram
source: Shutdown Program
hu_hu: Program Leállítás

# LogType.ClearProgramInstances
source: Clear Processes
hu_hu: Folyamatok Törlése

# LogType.MoveProgramInstance
source: Move Process
hu_hu: Folyamat Mozgatás

# LogType.OptimizeProgramInstances
source: Optimize Processes
hu_hu: Folyamatok Optimalizálása

# LogType.ModifyComputer
source: Modify Computer
hu_hu: Számítógép Módosítás

# LogType.SpreadProgramInstances
source: Spread Processes
hu_hu: Folyamatok Szórása

# LogType.FixIssues
source: Fix Issues
hu_hu: Problémák Javítása

# LogType.ActivateProgramInstance
source: Activate Process
hu_hu: Folyamat Aktiválás

# LogType.DeactivateProgramInstance
source: Deactivate Process
hu_hu: Folyamat Deaktiválás

# LogType.GenerateCluster
source: Generate Cluster
hu_hu: Klaszter Generálás

# LogDetail.Path
source: Path
hu_hu: Elérési Út

# LogDetail.Name
source: Name
hu_hu: Név

# LogDetail.CPU
source: Processor
hu_hu: Processzor

# LogDetail.Memory
source: Memory
hu_hu: Memória

# LogDetail.Type
source: Type
hu_hu: Típus

# LogDetail.Active programs
source: Active Programs
hu_hu: Aktív Programok

# LogDetail.Instance
source: Process
hu_hu: Folyamat

# LogDetail.Start
source: Start
hu_hu: Kezdés

# LogDetail.Active
source: Active
hu_hu: Aktív

# LogDetail.Computer
source: Computer
hu_hu: Számítógép

# LogDetail.Instances
source: Processes
hu_hu: Folyamatok

# LogDetail.Process count
source: Process Count
hu_hu: Folyamatok száma

# LogDetail.Source computer
source: Source Computer
hu_hu: Forrás számítógép

# LogDetail.Destination computer
source: Destination Computer
hu_hu: Cél számítógép

# LogDetail.Minimum Percent
source: Minimum Percent
hu_hu: Minimum Százalék

# LogDetail.Maximum Percent
source: Maximum Percent
hu_hu: Maximum Százalék

# LogDetail.Computers
source: Computers
hu_hu: Számítógépek

# LogDetail.CPU Capacity
source: Processor Capacity
hu_hu: Processzor Kapacitás

# LogDetail.Memory Capacity
source: Memory Capacity
hu_hu: Memória Kapacitás

# LogDetail.CPU Spread Percent
source: Processor Spread Percent
hu_hu: Processzor Szórás Százalék

# LogDetail.RAM Spread Percent
source: Memory Spread Percent
hu_hu: Memória szórás százalék

# LogDetail.Processes
source: Processes
hu_hu: Folyamatok

# LogDetail.Processor Usage
source: Processor Usage
hu_hu: Processzor Használat

# LogDetail.Memory Usage
source: Memory Usage
hu_hu: Memória Használat

# LogDetail.Host Computer
source: Computer
hu_hu: Számítógép

# LogDetail.Programtypes
source: Programs
hu_hu: Programok

# LogDetail.Fixed Processes
source: Fixed Processes
hu_hu: Javított Folyamatok
